colors = ['чорний','червоний','зелений','жовтий','блакитний','білий','помаранчевий','синій']
print(("Кольори:"), ', '.join(str(x) for x in colors))
i = ['....................']

from collections import Counter
import re

t = '''Я знаю 
Світ прекрасний дивний ніжний 
Він весь цвіте у чудо-кольорах 
І чорний колір не сумний 
Він вічний 
Циганські чорні коси 
Ворон-птах 
Я знаю 
Світ міняється щоденно 
І він не завжди свято 
А й біда 
І сніжно-білий не завжди 
політ голубки в небо 
А іноді це саван 
це пітьма 
Я знаю 
Світ несамовито дивний 
Бурлить у венах і палає у душі 
Ми звикли 
Що життя чомусь зелене 
Тріпоче листям на деревах 
Яскравіє у траві 
А синій колір 
Він мов світ незримий 
Блакитне небо 
Неозорий край 
Та трішки смутку має в собі синій 
Це вічний холод 
Й самоти печаль 
І жовте сонце 
Промінці надії 
І святість Бога в жовтому кільці 
Це колір віри і любові й мрії 
Й колір розлуки 
жовті пелюстки 
Червона пристрасть 
губи малинОві 
Червоні маки в полі на зорі 
Чудовий колір 
колір для любові 
Приглянься ближче 
Це ж бо й дань війні 
Палітра ніжна барви веселкові 
Які прекрасні в світі кольори 
Всі кольори прийшли до нас від Бога 
А нотки смутку їм даємо ми'''.lower()
print(("Слова що мають корені кольорів "),{b: t.count(b.lower()) for b in ("чорн", "червон", "зелен", "жовт","блакитн","біл","помаранч", "син")})
print("Якщо подивитися на статистику то стане ясно який колір переважає над іншими")

